
* Codeoff
** DONE Make users, creation and login.
   :CLOCK:
   CLOCK: [2010-02-22 Mon 16:46]--[2010-02-22 Mon 17:07] =>  0:21
   CLOCK: [2010-02-22 Mon 14:11]--[2010-02-22 Mon 14:58] =>  0:47
   :END:
** TODO Make initial pairing implementation
   :CLOCK:
   CLOCK: [2010-02-22 Mon 18:24]--[2010-02-22 Mon 20:14] =>  1:50
   CLOCK: [2010-02-22 Mon 18:08]--[2010-02-22 Mon 18:23] =>  0:15
   :END:
** DONE Make initial database layout
   CLOCK: [2010-02-22 Mon 17:34]--[2010-02-22 Mon 18:08] =>  0:34


** TODO Challenge Off
*** TODO Run Code
*** TODO Return errors
